app/controllers/pois_controller.rb

  def index
    @pois = Poi.all
---
SELECT "pois".* FROM "pois"

  def show
    @poi = Poi.find(params[:id])
---
SELECT  "pois".* FROM "pois" WHERE "pois"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def create
    @poi = Poi.new(poi_params)
    if @poi.save
---
INSERT INTO "pois" ("name", "x", "y", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "teste"], ["x", 2], ["y", 4], ["created_at", "2019-07-11 00:54:51.599037"], ["updated_at", "2019-07-11 00:54:51.599037"]]

  def destroy
    @poi = Poi.find(params[:id])
    @poi.destroy
---
SELECT  "pois".* FROM "pois" WHERE "pois"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "pois" WHERE "pois"."id" = $1  [["id", 3]]

  def calculate_distance
    @coordinate_x = params[:x].to_i
    @coordinate_y = params[:y].to_i
    @radius = params[:radius].to_i
    @pois = Poi.all
    @result_pois = []

    @pois.each do |poi|
---
SELECT "pois".* FROM "pois"